{
  "plugins": {
    "barbar.nvim": {
      "src": "https://github.com/romgrk/barbar.nvim"
    },
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp"
    },
    "none-ls.nvim": {
      "src": "https://github.com/nvimtools/none-ls.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-java": {
      "src": "https://github.com/nvim-java/nvim-java"
    },
    "nvim-jdtls": {
      "src": "https://github.com/mfussenegger/nvim-jdtls"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-parinfer": {
      "src": "https://github.com/gpanders/nvim-parinfer"
    },
    "nvim-tree.lua": {
      "src": "https://github.com/nvim-tree/nvim-tree.lua"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "oldworld.nvim": {
      "src": "https://github.com/dgox16/oldworld.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "rustaceanvim": {
      "src": "https://github.com/mrcjkb/rustaceanvim"
    },
    "spring-boot.nvim": {
      "src": "https://github.com/JavaHello/spring-boot.nvim",
      "version": "'218c0c26c14d99feca778e4d13f5ec3e8b1b60f0'"
    },
    "yuck.vim": {
      "src": "https://github.com/elkowar/yuck.vim"
    }
  }
}